
import { Link } from 'react-router-dom';

export default function Policy() {
  return (
    <div className="container-fluid">
        <h1 className="section-title">
            Политика в отношении обработки персональных данных
        </h1>
        <div class="row flex-column-reverse flex-lg-row gap-5 gap-md-0">
            <div class="col-12 col-lg-8">
                <div data-bs-spy="scroll" data-bs-target="#list-example" data-bs-smooth-scroll="true" className="scrollspy-example d-flex flex-column gap-5" tabindex="0">
                    <div>
                        <p className='fs-5 fw-semibold'>
                            Настоящая Политика в отношении обработки персональных данных (далее — Политика) разработана в соответствии с Федеральным законом от 27.07.2016 «152-ФЗ «О персональных данных» (далее — ФЗ-152).
                        </p>
                        <p className='fs-5 fw-semibold'>
                            Настоящая Политика определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных в «ЛАЗЕР КЛИНИК» (далее — Компания) с целью защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
                        </p>
                    </div>
                    <div>
                        <h4 id="list-item-1" className='fs-4 fw-semibold'>Цели обработки персональных данных</h4>
                        <ul className=''>
                            <li className='fw-medium'>
                                Для улучшения обслуживания клиентов. Информация, которую Вы предоставляете, позволяет более эффективно реагировать на Ваши запросы;
                            </li>
                            <li className='fw-medium'>
                                Для улучшения нашего сайта. Мы можем использовать обратную связь, которую Вы предоставляете, чтобы улучшить наши услуги
                            </li>
                            <li className='fw-medium'>
                                Для персонализации пользовательского опыта. Мы можем использовать информацию для определения кто из посетителей нашего сайта наиболее заинтересован в наших услугах
                            </li>
                        </ul>
                    </div>
                    <div>
                        <h4 id="list-item-2" className='fs-4 fw-semibold'>Общие принципы и условия обработки персональных данных клиентов и работников</h4>
                        <h3 className='fs-6 fw-semibold'>Обработка персональных данных должна осуществляться на законной и справедливой основе;</h3>            
                        <ul className=''>
                            <li className='fw-medium'>
                                Обработка персональных данных должна ограничиваться достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных;
                            </li>
                            <li className='fw-medium'>
                                Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой;
                            </li>
                            <li className='fw-medium'>
                                Обработке подлежат только персональные данные, которые отвечают целям их обработки;
                            </li>
                            <li className='fw-medium'>
                                Содержание и объем обрабатываемых персональных данных должны соответствовать заявленным целям обработки. Обрабатываемые персональные данные не должны быть избыточными по отношению к заявленным целям их обработки;
                            </li>
                            <li className='fw-medium'>
                                При обработке персональных данных должны быть обеспечены точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Компания должна принимать необходимые меры либо обеспечивать их принятие по удалению или уточнению неполных или неточных данных.
                            </li>
                        </ul>
                        <h3 className='fs-6 fw-semibold'>Компания обязуется не передавать полученные персональные данные третьим лицам, за исключением следующих случаев:</h3>            
                        <ul className=''>
                            <li className='fw-medium'>
                                Стратегическим партнерам, которые работают с Компанией для предоставления продуктов и услуг, или тем из них, которые помогают Компании реализовывать продукты и услуги потребителям. Мы предоставляем третьим лицам минимальный объем персональных данных, необходимый только для оказания требуемой услуги;
                            </li>
                            <li className='fw-medium'>
                                По запросам уполномоченных органов государственной власти РФ только по основаниям и в порядке, установленном законодательством РФ.
                            </li>
                        </ul>
                    </div>
                    <div>
                        <h4 id="list-item-3" className='fs-4 fw-semibold'>Персональные данные Пользователя</h4>
                        <p className='fw-medium'>
                            Вводя личные данные в какой-либо форме обратной связи на Сайте, нажимая кнопку «Отправить», Пользователь принимает решение о предоставлении своих персональных данных и дает согласие на их обработку своей волей и в своем интересе, при этом такое согласие Пользователя является конкретным и сознательным.
                        </p>
                        <p className='fw-medium'>
                            Администрация сайта не проверяет достоверность персональной информации, которая предоставляется Пользователями, и не осуществляет проверку их дееспособности. При этом Администрация Сайта исходит из того, что информация, переданная им от Пользователей, является достоверной.
                        </p>
                        <p className='fw-medium'>
                            Обработка персональных данных может вестись как с использованием средств автоматизации, так и без них.
                        </p>
                        <p className='fw-medium'>
                            Также на нашем сайте используются файлы cookie для обеспечения правильной и эффективной работы сайта, а также для получения нами аналитической информации.
                        </p>
                        <p className='fw-medium'>
                            При использовании нашего сайта, Вы подтверждаете свое согласие на использование файлов cookie. В случае Вашего несогласия с использованием cookie, просим Вас произвести соответствующие настройки в браузере, либо покинуть наш сайт. Подробнее об использовании файлов cookie см. здесь.
                        </p>
                        <p className='fw-medium'>
                            Политика безопасности и защиты персональных данных обеспечивается путем принятия правовых, организационных и технических мер. К ним можно отнести:
                        </p>
                        <ul className=''>
                            <li className='fw-medium'>
                                определение перечня информации, составляющей персональные данные субъектов, обрабатываемые Компанией;
                            </li>
                            <li className='fw-medium'>
                                ограничение доступа к информации, составляющей персональные данные субъектов, путем установления порядка обращения с этой информацией и контроля соблюдения такого порядка;
                            </li>
                            <li className='fw-medium'>
                                учет лиц, получивших доступ к информации, составляющей персональные данные субъектов, и (или) лиц, которым такая информация была предоставлена или передана;
                            </li>
                            <li className='fw-medium'>
                                обеспечение защиты персональных данных от несанкционированного доступа;
                            </li>
                            <li className='fw-medium'>
                                другие меры, которые не противоречат законодательству Российской Федерации.
                            </li>
                            <p className='fw-medium'>
                                В целях соблюдения требований законодательства Компанией приняты локальные акты, регламентирующие порядок обработки персональных данных, и определяющие его политику в отношении их обработки.
                            </p>
                        </ul>
                    </div>
                    <div>
                        <h4 id="list-item-4" className='fs-4 fw-semibold'>Конфиденциальность и безопасность персональных данных</h4>
                        <p className='fw-medium'>
                            Мы не разглашаем полученные нами в результате своей профессиональной деятельности персональные данные. Работники, получившие доступ к персональным данным, принимают обязательства по обеспечению конфиденциальности обрабатываемых персональных данных.
                        </p>
                        <p className='fw-medium'>
                            Мы принимаем необходимые технические и организационные меры информационной безопасности для защиты персональных данных от несанкционированного доступа, изменения, раскрытия или уничтожения, путем внутренних проверок процессов сбора, хранения и обработки данных и мер безопасности, а также осуществления мер по обеспечению физической безопасности данных для предотвращения несанкционированного доступа к системам, в которых мы храним персональные данные.
                        </p>
                    </div>
                    <div>
                        <h4 id="list-item-5" className='fs-4 fw-semibold'>Обработка персональных данных Пользователей</h4>
                        <p className='fw-medium'>
                            Принятие условий настоящей Политики в части положений об обработке персональных данных, осуществляется путем проставления Пользователем соответствующей отметки при заполнении любой формы обратной связи и является выраженным осознанным согласием Пользователя на обработку персональных данных.
                        </p>
                        <p className='fw-medium'>
                            Пользователь соглашается с тем, что Администрация Сайта имеет право на хранение и обработку, в том числе и автоматизированную, любой информации, относящейся к персональным данным Пользователя в соответствии с Федеральным законом от 27.07.2006 г. № 152-ФЗ «О персональных данных», включая сбор, систематизацию, накопление, хранение, уточнение, использование, распространение (в том числе передачу), обезличивание, блокирование, уничтожение персональных данных, предоставленных Пользователем при заполнении формы обратной связи на Сайте.
                        </p>
                        <p className='fw-medium'>
                            Согласие на обработку персональных данных может быть в любой момент отозвано Пользователем путем письменного обращения в адрес Администрации Сайта. В случае отзыва Пользователем согласия на обработку персональных данных, Администрация Сайта удаляет персональные данные Пользователя и не вправе использовать их в будущем.
                        </p>
                        <p className='fw-medium'> 
                            Администрацией Сайта обеспечивается конфиденциальность и безопасность при обработке персональных данных. Мы принимаем соответствующие меры безопасности по сбору, хранению и обработке любых собранных данных для защиты их от несанкционированного доступа, изменения, раскрытия или уничтожения Вашей личной информации (ФИО, номер телефона, адрес электронной почты).
                        </p>
                    </div>
                    <div>
                        <h4 id="list-item-6" className='fs-4 fw-semibold'>Согласие с условиями настоящей Политики</h4>
                        <p className='fw-medium'>
                            Используя наш Сайт, Вы выражаете свое конкретное и осознанное согласие с этой Политикой. Если Вы не согласны с этой Политикой, просим Вас не использовать наш Сайт. Ваше дальнейшее использование Сайта после внесения изменений в настоящую Политику будет рассматриваться как Ваше согласие с этими изменениями.
                        </p>
                    </div>
                    <div>
                        <h4 id="list-item-7" className='fs-4 fw-semibold'>Отказ от ответственности</h4>
                        <p className='fw-medium'>
                            Политика компании в отношении обработки персональных данных при посещении сторонних Сайтов третьих лиц не подпадает под действия данного документа. Администрация сайта не несет ответственности за действия других веб-сайтов.
                        </p>
                        <p className='fw-medium'>
                            Компания оставляет за собой право вносить изменения в одностороннем порядке в настоящие правила, при условии, что изменения не противоречат действующему законодательству РФ. Изменения условий настоящих правил вступают в силу после их публикации на Сайте.
                        </p>
                    </div>
                </div>
            </div>
            <div class="col-12 col-lg-4">
                <div id="list-example" className="card bg-secondary-subtle">
                    <div className="card-body p-4">
                        <h4 className="fs-3 fw-semibold mb-4">Содержание</h4>
                        <div className="list-group-numbered d-flex flex-column gap-2">
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-1">Цели обработки персональных данных</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-2">Общие принципы и условия обработки персональных данных клиентов и работников</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-3">Персональные данные Пользователя</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-4">Конфиденциальность и безопасность персональных данных</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-5">Обработка персональных данных Пользователей</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-6">Согласие с условиями настоящей Политики</a>
                            <a class="list-group-item list-group-item-action fs-6 fw-medium" href="#list-item-7">Отказ от ответственности</a>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
  );
};